In [3]:
import pandas as pd
from sqlalchemy import create_engine

# Example for MySQL database on localhost
# Replace 'your_username', 'your_password', 'your_database_name', and 'your_port' with your actual database credentials
database_url = "mysql+mysqlconnector://root:@localhost:3306/analystics_db"
engine = create_engine(database_url)
# Example query to fetch all data from a table
query = "SELECT * FROM employeedemographics"
df = pd.read_sql(query, engine)
df

   EmployeeID FirstName    LastName  Age  Gender
0        1001       Jim     Halpert   30    Male
1        1002       Pam     Beasley   30  Female
2        1003    Dwight     Schrute   29    Male
3        1004    Angela      Martin   31  Female
4        1005      Toby  Flenderson   32    Male
5        1006   Michael       Scott   35    Male
6        1007  Meredith      Palmer   32  Female
7        1008   Stanley      Hudson   38    Male
8        1009     Kevin      Malone   31    Male